<template>
    <div class="detail">
        <div class="top">
            <div class="name">{{ hospitalStore.hospitalInfo.hospital?.hosname }}</div>
            <div class="level">
                <svg t="1690728570740" class="icon" viewBox="0 0 1024 1024" version="1.1"
                     xmlns="http://www.w3.org/2000/svg" p-id="16444" width="16" height="16">
                    <path d="M621.674667 408.021333c16.618667-74.24 28.224-127.936 34.837333-161.194666C673.152 163.093333 629.941333 85.333333 544.298667 85.333333c-77.226667 0-116.010667 38.378667-138.88 115.093334l-0.586667 2.24c-13.728 62.058667-34.72 110.165333-62.506667 144.586666a158.261333 158.261333 0 0 1-119.733333 58.965334l-21.909333 0.469333C148.437333 407.808 106.666667 450.816 106.666667 503.498667V821.333333c0 64.8 52.106667 117.333333 116.394666 117.333334h412.522667c84.736 0 160.373333-53.568 189.12-133.92l85.696-239.584c21.802667-60.96-9.536-128.202667-70.005333-150.186667a115.552 115.552 0 0 0-39.488-6.954667H621.674667zM544.256 149.333333c39.253333 0 59.498667 36.48 49.888 84.928-7.573333 38.144-21.984 104.426667-43.221333 198.666667-4.512 20.021333 10.56 39.093333 30.912 39.093333h218.666666c6.101333 0 12.16 1.066667 17.909334 3.168 27.445333 9.984 41.674667 40.554667 31.776 68.266667l-85.568 239.573333C744.981333 838.026667 693.301333 874.666667 635.402667 874.666667H223.498667C194.314667 874.666667 170.666667 850.784 170.666667 821.333333V503.498667c0-17.866667 14.144-32.448 31.829333-32.821334l21.866667-0.469333a221.12 221.12 0 0 0 167.381333-82.56c34.346667-42.602667 59.146667-99.306667 74.869333-169.877333C482.101333 166.336 499.552 149.333333 544.266667 149.333333z"
                          fill="#000000" p-id="16445"></path>
                </svg>
                <span>{{ hospitalStore.hospitalInfo.hospital?.param.hostypeString }}</span>
            </div>
        </div>
        <div class="logo">
            <div class="left">
                <img :src="`data:image/jpeg;base64,${hospitalStore.hospitalInfo.hospital?.logoData}`" alt=""/>
            </div>
            <div class="right">
                <div class="address">
                    <svg t="1690987553811" class="icon" viewBox="0 0 1024 1024" version="1.1"
                         xmlns="http://www.w3.org/2000/svg" p-id="17559" width="16" height="16">
                        <path d="M512 128c169.6 0 308 138.4 308 308 0 81.6-31.2 158.4-88.8 216l-4.8 4L512 869.6 298.4 656.8l-4.8-4.8c-57.6-57.6-88.8-134.4-88.8-216C204 266.4 342.4 128 512 128m0-64C306.4 64 140 230.4 140 436c0 101.6 40.8 194.4 107.2 261.6L512 960l264-263.2c66.4-67.2 107.2-159.2 107.2-261.6C884 230.4 717.6 64 512 64z m0 192c73.6 0 132.8 62.4 128 137.6-4.8 63.2-55.2 113.6-118.4 118.4-74.4 5.6-137.6-53.6-137.6-128 0-70.4 57.6-128 128-128"
                              p-id="17560" fill="#1296db"></path>
                    </svg>
                    <span>具体位置：{{ hospitalStore.hospitalInfo.hospital?.param.fullAddress }}</span>
                </div>
                <div class="route">
                    <svg t="1690988587614" class="icon" viewBox="0 0 1024 1024" version="1.1"
                         xmlns="http://www.w3.org/2000/svg" p-id="18884" width="16" height="16">
                        <path d="M1008.274286 142.262857L890.514286 24.685714a54.857143 54.857143 0 0 0-75.154286 0l-117.577143 117.76a53.028571 53.028571 0 0 0 0 75.154286 53.028571 53.028571 0 0 0 75.154286 0l28.708571-28.708571v585.142857a117.394286 117.394286 0 1 1-234.605714 0V265.325714a224.365714 224.365714 0 0 0-448.548571 0V833.828571L91.428571 805.851429a53.211429 53.211429 0 0 0-75.702857 75.337142l117.76 117.577143a53.211429 53.211429 0 0 0 75.154286 0l117.577143-117.76a53.211429 53.211429 0 0 0-75.154286-75.154285l-25.965714 26.148571v-566.857143a118.125714 118.125714 0 0 1 236.068571 0v508.16a223.634286 223.634286 0 0 0 447.085715 0V192.182857L932.571429 217.417143a53.211429 53.211429 0 0 0 75.154285-75.154286z"
                              fill="#55a6fe" p-id="18885"></path>
                    </svg>
                    <span>规划路线：{{ hospitalStore.hospitalInfo.hospital?.route }}</span>
                </div>
            </div>
        </div>
        <div class="footer">
            <h1>医院介绍</h1>
            <p>{{ hospitalStore.hospitalInfo.hospital?.intro }}</p>
        </div>
    </div>
</template>

<script setup>
import useDetailStore from "@/store/modules/hospitalDetails.js";

let hospitalStore = useDetailStore();

</script>

<style scoped lang="scss">

.detail {
  span {
    line-height: 1.5;
  }

  .top {
    display: flex;
    align-items: center;

    .name {
      font-size: 30px;
      font-weight: 900;
    }

    .level {
      margin-left: 10px;
      color: #7f7f7f;

      span {
        margin-left: 5px;
      }
    }
  }

  .logo {
    display: flex;
    margin: 10px 0;

    .left {
      img {
        width: 80px;
        height: 80px;
        border-radius: 50%;
      }
    }

    .right {
      color: #7f7f7f;
      margin-left: 10px;

      div {
        margin: 10px 0;
      }

      span {
        margin-left: 10px;
      }
    }
  }

  .footer {
    color: #7f7f7f;

    p {
      margin-top: 10px;
      line-height: 30px;
    }
  }
}

</style>